# priority_hashtags = {
#     "Приоритет": [
#         "6 - не назначен",
#         "5 - наивысший",
#         "4 - высокий",
#         "3 - средний",
#         "2 - низкий",
#         "1 - наименьший",
#     ]
# }
#
# urgent_hashtags = {
#     "Срочность": [
#         "Urgent",
#         "Not urgent",
#         "Limited - experimet",
#         "Limited - Хотелки",
#         "Not limited",
#     ]
# }
#
#
# tasks_type_hashtags = {"Тип": ["Независимая задача", "Задача", "Проект", "Эпик"]}
#
# department_hashtags = {
#     "Департамент": [
#         "Разработка",
#         "Личная продуктивность",
#         "Asana",
#         "Project management",
#         "Вечеринки",
#         "Школа 146",
#         "Тимлидинг",
#     ]
# }


dict_of_hashtags = {
    "Приоритет": {
        "#высший": "5 - наивысший",
        "#наивысший": "5 - наивысший",
        "#высокий": "4 - высокий",
        "#средний": "3 - средний",
        "#низкий": "2 - низкий",
        "#наименьший": "1 - наименьший",
        "#5": "5 - наивысший",
        "4": "4 - высокий",
        "#3": "3 - средний",
        "#2": "2 - низкий",
        "#1": "1 - наименьший",
    },
    "Срочность": {
        "#срочно": "Urgent",
        "#несрочно": "Not urgent",
        "#эксперимент": "Limited - experimet",
        "#хотелки": "Limited - Хотелки",
        "#потом": "Not limited",
    },
    "Департамент": {
        "#прога": "Разработка",
        "#продуктивность": "Личная продуктивность",
        "#асана": "Asana",
        "#менеджмент": "Project management",
        "#вечеринки": "Вечеринки",
        "#школа": "Школа 146",
        "#тимлидинг": "Тимлидинг",
    },
}

tags = {
"Теги": {
        "Active",
        "Team Task",
        "Onboarding",
        "Сложная",
        "New",
        "Don't lose",
        "Candidate",
    }
}

templates = {
    "purchase": ["#покупка", "#покупки", "#купить", "#п"],
    "task": ["#задача", "#task", "#з"],
    "streaming_task": ["#н", "#нз"],
    "project": ["#проект"],
}
